# 2 Mostrando Dataframe

In [2]:
import pandas as pd

In [5]:
# Leyendo el archivo CSV
df_familia = pd.read_csv('familia.csv')

In [6]:
df_familia

     Nombres   Edad genero          Trabajo
0     Moises     24      M      Programador
1    Lluvia      46      F        Repostera
2     Aaron      22      M             Chef
3      Itzel     28      F          Doctora
4    Alberto     26      M     Biotecnologo
5     Junuen     27      F  Ing. Industrial
6  Francisco     20     M           Locutor

In [8]:
# Mostrando primeras 5 filas del dataframe
df_familia.head()

   Nombres   Edad genero       Trabajo
0   Moises     24      M   Programador
1  Lluvia      46      F     Repostera
2   Aaron      22      M          Chef
3    Itzel     28      F       Doctora
4  Alberto     26      M  Biotecnologo

In [10]:
# Mostrando ultimas 5 filas del dataframe
df_familia.tail(3)

     Nombres   Edad genero          Trabajo
4    Alberto     26      M     Biotecnologo
5     Junuen     27      F  Ing. Industrial
6  Francisco     20     M           Locutor

In [12]:
## Accediendo al atributo shape
df_familia.shape

(7, 4)

In [11]:
# Mostrar "n" filas
pd.set_option('display.max_rows',1000)
df_familia

     Nombres   Edad genero          Trabajo
0     Moises     24      M      Programador
1    Lluvia      46      F        Repostera
2     Aaron      22      M             Chef
3      Itzel     28      F          Doctora
4    Alberto     26      M     Biotecnologo
5     Junuen     27      F  Ing. Industrial
6  Francisco     20     M           Locutor